import React from "react";
import "./Home11.css"

function Home11() {
  return (
    <div className="main">
      <h1>Путешествия</h1>
      <p>Исследуйте мир вместе с нами</p>

      <nav>
        <ul>
          <li>
            <a href="#">Главная</a>
          </li>
          <li>
            <a href="#">О нас</a>
          </li>
          <li>
            <a href="#">Путешествия</a>
          </li>
          <li>
            <a href="#">Контакты</a>
          </li>
        </ul>
      </nav>

      <h2>Добро пожаловать в мир путешествий</h2>
      <p>
        Мы рады представить вам наш сайт, посвященный путешествиям. Здесь вы
        найдете множество интересных статей о различных уголках мира, а также
        сможете поделиться своими впечатлениями и фотографиями.
      </p>

      <h3>Новые статьи</h3>
      <ul>
        <li>
          <a href="#">Путешествие в Италию: города, которые стоит посетить</a>
        </li>
        <li>
          <a href="#">
            Отпуск на Мальдивах: как выбрать отель и что посмотреть
          </a>
        </li>
        <li>
          <a href="#">Поездка на автомобиле по США: советы и рекомендации</a>
        </li>
      </ul>

      <h3>Последние комментарии</h3>
      <ul>
        <li>
          <a href="#">
            Комментарий к статье "Путешествие в Италию: города, которые стоит
            посетить"
          </a>
        </li>
        <li>
          <a href="#">
            Комментарий к статье "Отпуск на Мальдивах: как выбрать отель и что
            посмотреть"
          </a>
        </li>
        <li>
          <a href="#">
            Комментарий к статье "Поездка на автомобиле по США: советы и
            рекомендации"
          </a>
        </li>
      </ul>
    </div>
  );
}

export default Home11;
